tutorials/zdlbTests/1-feature/pimpleFoamBalance/5-cavity-ami/Allrun.parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.pre

runParallel -o $(getApplication)

runParallel -s "final" postProcess -func processorField

touch case.foam

#------------------------------------------------------------------------------
