tutorials/zdlbTests/1-feature/pimpleFoamBalance/5-cavity-ami/constant/dynamicLoadBalanceDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicLoadBalanceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Mandatory entries
balanceModel            distributed;
performanceMetric       cpuLoad;

// Optional entries
frequency               1;
imbalanceThreshold      0.000001;


// ************************************************************************* //
