tutorials/zdlbTests/1-feature/pimpleFoamBalance/5-cavity-ami/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

solver          solidBody;
solidBodyMotionFunction linearMotion;
linearMotionCoeffs
{
    velocity    (0.2 0 0);
}

motionSolverLibs (fvMotionSolvers);

// ************************************************************************* //
