tutorials/zdlbTests/1-feature/pimpleFoamBalance/5-cavity-ami/system/decomposeParDict.hierar
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  2;

method              scotch;
method              hierarchical;

coeffs
{
    n (1 2 1);
}
/*
scotchCoeffs
{
    processorWeights
    (
        1041 998959
    );
}
*/
// ************************************************************************* //
