tutorials/zdlbTests/1-feature/pimpleFoamBalance/5-cavity-ami/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    AMI_faceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.06 -0.15 -0.15) (0.07 0.15 0.15);
    }

    {
        name    AMI_faceZone;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        faceSet AMI_faceSet;
    }
);

// ************************************************************************* //
